Revit 2027 API
BuiltInFailures.ElectricalFailures.TransformerNoDistributionSystem Property
 At least one of the distribution systems of Electrical Analytical Transformer [Name] is set to None. Assign distribution systems to the transformer.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId TransformerNoDistributionSystem { get; }
Public Shared ReadOnly Property TransformerNoDistributionSystem As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ TransformerNoDistributionSystem {
	FailureDefinitionId^ get ();
}
static member TransformerNoDistributionSystem : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ElectricalFailures Class
Autodesk.Revit.DB Namespace